//CBITEM      JOB (1),NOTIFY=&SYSUID
//***************************************************/
//COBRUN     EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..MTM20.CBL(CBITEM),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..MTM20.LOAD(CBITEM),DISP=SHR
