//FTFREQ      JOB (1),NOTIFY=&SYSUID
//***************************************************/
//COBRUN     EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..MTM20.CBL(FTFREQ),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..MTM20.LOAD(FTFREQ),DISP=SHR
