//GEN1        JOB (1),NOTIFY=&SYSUID
//***************************************************/
//COBRUN     EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..MTM20.CBL(GEN1),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..MTM20.LOAD(GEN1),DISP=SHR
