//*
//* PROCEDURE TO DELETE A DATASET IF IT EXISTS
//*
//RMPROC   PROC
//PROC1    EXEC PGM=IEFBR14
//THEFILE  DD DSN=&DSNME,
//         DISP=(MOD,DELETE,DELETE),
//         SPACE=(TRK,(1,1)),
//         DCB=(DSORG=PS,RECFM=F,LRECL=80)
//         PEND
